#+BLOG: wordpress
#+POSTID: 13
#+DATE: [2018-05-28 Mon 10:10]
* Source code

#+TITLE:  Yeldon is learning Org-mode

#+BEGIN_SRC octave
  clear
  clc

  A = 1;
  disp(A);
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :results output : exports both

  import numpy
  import sklearn

  a=0
  print(a)
#+END_SRC

#+RESULTS:
: 0

* LaTeX integration

- Characters: \alpha \rightarrow \beta
- $\frac{1}{2}$

$\siagma_{1}^{n}$

\begin{align*}
  3 * 2 + & = 6 + 1\\
          & = 7
\end{align*}

* Liberate programing
  
* 中文输入？
Emacs-GUI里启动fcitx没搞定，不过terminal里面可以正常输入，中文就用terminal的emacs好了。
